src/UpdateTask.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <UpdateTask xmlns="http://tempuri.org/">
      <strTaskID>&strTaskID</strTaskID>
      <USERID>&USERID</USERID>
      <MFROM>&MFROM</MFROM>
      <SUBJECT>&SUBJECT</SUBJECT>
      <PRIORITY>&PRIORITY</PRIORITY>
      <ENDDATE>&ENDDATE</ENDDATE>
      <REMINDTYPE>&REMINDTYPE</REMINDTYPE>
      <REMINDNUM>&REMINDNUM</REMINDNUM>
      <ATTFILES>&ATTFILES</ATTFILES>
      <TOMAILADDR>
        <string>&string</string>
      </TOMAILADDR>
    </UpdateTask>
  </soap:Body>
</soap:Envelope>